import streamlit as st

st.title("О приложении")
st.markdown(
    ":blue-badge[:material/check: CNN] :red-badge[:material/check: PostgreSQL]"
)
st.markdown(
    ":green-badge[:material/check: Streamlit] :violet-badge[:material/check: Coffee roast]"
)

text = """
## 🧋 Определение обжарки кофейных зерен

![Картика с латте](https://www.torrefacto.ru/upload/uf/d00/mdoibknztzibkoforsrbpa93ijzbhw9f.jpg)

Программа определяет степень обжарки кофе при помощи сверточной нейронной сети (CNN). 
Обучена на [датасете](https://www.kaggle.com/datasets/sot2542/coffee-bean-dataset-v1/data) с kaggle. Определяет 4 степени обжарки: зеленые зерна,
светлая, средняя и темная обжарка. 

В дальнейшем планируется повысить надежность нейронной сети, дообучив ее на 
датасете, содержащем посторонние предметы (будет добавлен новый класс - "не кофейное зерно"), а также оптимизировать саму архитектуру нейронной сети
"""

st.markdown(text)